
#+LATEX_CLASS: article
#+LATEX_CLASS_OPTIONS:
#+LATEX_HEADER:
#+LATEX_HEADER_EXTRA:
#+DESCRIPTION:
#+KEYWORDS:
#+SUBTITLE:
#+LATEX_COMPILER: pdflatex
#+Title: The N-back Test
#+Latex_header: \bibliographystyle{plain}

*** TODO R code: ensure table aligns with a page upon generation in pdf (or insert sideways)
#+BEGIN_SRC R :session *tables* :exports both :results replace
  table4 <- read.csv("./dataFromPaper/csvfpsyg-06-01544.csv")


#+END_SRC

#+RESULTS:
|        |            | nil |  Age group |            |            |            |            |            |            |  Age group |            |            |            |            |            |            |
|        |            | nil |          7 |          8 |          9 |         10 |         11 |         12 |         13 |          7 |          8 |          9 |         10 |         11 |         12 |         13 |
|        |            | nil | ( n = 193) | ( n = 285) | ( n = 310) | ( n = 297) | ( n = 315) | ( n = 253) | ( n = 233) | ( n = 194) | ( n = 307) | ( n = 296) | ( n = 321) | ( n = 286) | ( n = 223) | ( n = 209) |
| Total  | M          | nil |      14.45 |      16.71 |      17.63 |      20.23 |      21.94 |       22.5 |      24.82 |      14.25 |      15.58 |       18.7 |      21.07 |      23.24 |       24.7 |       27.2 |
|        | SD         | nil |       8.49 |        9.2 |       9.17 |       9.44 |        9.9 |       9.66 |       9.85 |       8.58 |       8.41 |       9.29 |        9.1 |       9.28 |       9.21 |       8.74 |
|        | Percentile |   5 |          3 |          3 |          4 |          4 |          4 |          4 |          4 |          2 |          3 |          4 |          5 |          5 |          7 |         11 |
|        |            |  25 |          7 |         10 |         10 |         13 |         14 |         14 |         18 |          8 |         10 |         12 |         13 |         16 |         18 |         23 |
|        |            |  50 |         13 |         15 |         16 |         21 |         24 |         24 |         28 |         13 |         15 |         18 |         22 |         25 |         26 |         30 |
|        |            |  75 |         22 |         25 |         25 |         28 |         30 |         30 |         32 |         20 |         22 |         26 |         28 |         31 |         31 |         34 |
|        |            |  95 |         28 |         32 |         32 |         35 |         35 |         37 |         37 |         30 |         30 |         34 |         35 |         35 |         38 |         39 |
| 1-back | M          | nil |       8.05 |       8.82 |       9.14 |       9.72 |      10.01 |       10.2 |      10.28 |       8.21 |        8.6 |       9.54 |      10.11 |      10.41 |      10.73 |      11.29 |
|        | SD         | nil |       3.04 |       3.09 |       2.82 |       2.96 |       2.98 |       2.96 |       2.96 |       3.29 |       3.09 |       3.12 |       2.86 |       2.77 |       2.55 |       2.34 |
|        | Percentile |   5 |          3 |          3 |          4 |          4 |          4 |          4 |          4 |          2 |          3 |          4 |          5 |          5 |          6 |          7 |
|        |            |  25 |          6 |          7 |          7 |          8 |          8 |          8 |          9 |          6 |          6 |          7 |          8 |          9 |          9 |         10 |
|        |            |  50 |          8 |          9 |          9 |         10 |         11 |         11 |         11 |          8 |          9 |         10 |         11 |         11 |         11 |         12 |
|        |            |  75 |         10 |         11 |         11 |         12 |         12 |         13 |         12 |         11 |         11 |         12 |         12 |         12 |         13 |         13 |
|        |            |  95 |         13 |         13 |         13 |         14 |         14 |         14 |         14 |         14 |         13 |         14 |         14 |         14 |         14 |         14 |
| 2-back | M          | nil |        4.1 |       5.02 |       5.23 |       6.29 |       6.96 |       7.26 |       8.16 |       3.96 |       4.53 |       5.74 |       6.52 |       7.44 |       7.93 |       9.11 |
|        | SD         | nil |       3.64 |       3.67 |       3.81 |       3.78 |       4.08 |       3.91 |       3.99 |       3.59 |       3.49 |       3.76 |        3.5 |       3.68 |       3.77 |       3.75 |
|        | Percentile |   5 |          – |          – |          – |          – |          – |          – |          – |          – |          – |          – |          – |          – |          – |          2 |
|        |            |  25 |          – |          2 |          2 |          3 |          4 |          5 |          6 |          – |          1 |          3 |          4 |          5 |          6 |          7 |
|        |            |  50 |          4 |          5 |          5 |          6 |          7 |          8 |          9 |          3 |          5 |          6 |          7 |          8 |          8 |         10 |
|        |            |  75 |          7 |          8 |          8 |          9 |         10 |         11 |         11 |          6 |          7 |          9 |          9 |         10 |         11 |         12 |
|        |            |  95 |         11 |         11 |         12 |         12 |         13 |         13 |         13 |         11 |         10 |         12 |         12 |         13 |         13 |         14 |
| 3-back | M          | nil |        2.3 |       2.87 |       3.26 |       4.23 |       4.97 |       5.04 |       6.37 |       2.07 |       2.45 |       3.41 |       4.44 |       5.38 |       6.05 |        6.8 |
|        | SD         | nil |       3.41 |       3.81 |       3.91 |       4.15 |       4.27 |       4.12 |       4.27 |       3.46 |       3.46 |       3.98 |       4.24 |       4.28 |       4.36 |       4.11 |
|        | Percentile |   5 |          – |          – |          – |          – |          – |          – |          – |          – |          – |          – |          – |          – |          – |          – |
|        |            |  25 |          – |          – |          – |          – |          – |          – |          2 |          – |          – |          – |          – |          – |          1 |          5 |
|        |            |  50 |          – |          – |          – |          4 |          6 |          6 |          7 |          – |          – |          – |          5 |          6 |          7 |          8 |
|        |            |  75 |          5 |          6 |          7 |          8 |          9 |          8 |         10 |          4 |          5 |          7 |          8 |          9 |         10 |         10 |
|        |            |  95 |          9 |         10 |         11 |         11 |         11 |         11 |         12 |         10 |         10 |         10 |         11 |         12 |         12

